Repository: yehiaAboulela/roya-nano-app
Catalog: src/locale/messages.*.xlf
Languages: ar

source: Why Royal Nano
ar: لماذا رويال نانو

source: Fast and efficient solutions for your car needs.
ar: حلول سريعة وفعالة لاحتياجات سيارتك

source: We provide cutting-edge technology that ensures speed and reliability, helping your business stay ahead in a competitive market.
ar: نوفر تكنولوجيا حديثة تضمن السرعة والموثوقية، مما يساعد عملك على التميز في سوق تنافسي

source: Innovative leadership that inspires progress and growth.
ar: قيادة مبتكرة تُلهم التقدم والنمو

source: Our forward-thinking leadership drives innovation, fostering a culture of continuous improvement and development.
ar: قيادتنا ذات الرؤية المستقبلية تحفز الابتكار وتعزز ثقافة التحسين والتطوير المستمر

source: 24/7 customer support to assist you whenever needed.
ar: دعم عملاء على مدار الساعة لمساعدتك متى احتجت

source: Our dedicated team is always available, providing expert guidance and support to ensure your satisfaction around the clock.
ar: فريقنا المتفاني متاح دائمًا لتقديم التوجيهات الخبيرة والدعم لضمان رضاك على مدار الساعة

source: Committed to sustainability and eco-friendly practices.
ar: ملتزمون بالممارسات المستدامة والصديقة للبيئة

source: We prioritize eco-conscious practices, ensuring our operations are sustainable and contribute to a greener future.
ar: نولي أولوية للممارسات الواعية بالبيئة، مما يضمن أن عملياتنا مستدامة وتساهم في مستقبل أكثر اخضرارًا

source: Nermin Maher
ar: نرمين ماهر

source: Their service is absolutely amazing! My car looks brand new again thanks to Royal Nano Ceramic protection. The team is incredibly professional.
ar: خدماتهم مذهلة تمامًا! سيارتي تبدو جديدة مرة أخرى بفضل حماية رويال نانو للسيراميك. الفريق محترف للغاية

source: Ahmad rezk
ar: أحمد رزق

source: There are no words to describe the service they provided at Royal Nano Ceramic. The protection is excellent, and my car looks brand new
ar: لا توجد كلمات لوصف الخدمة التي قدموها في رويال نانو للسيراميك. الحماية ممتازة، وتبدو سيارتي جديدة تمامًا

source: Maha ahmad
ar: مها أحمد

source: Royal Nano Ceramic is the perfect place to protect your car. The result was beyond amazing, and I'm very happy
ar: رويال نانو للسيراميك هو المكان المثالي لحماية سيارتك. النتائج كانت رائعة للغاية، وأنا سعيد جدًا

source: Mohamed nagaty
ar: محمد نجاتي

source: Truly, the best car protection you can find is at Royal Nano Ceramic. Your car comes out looking completely transformed
ar: حقًا، أفضل حماية للسيارة تجدها في رويال نانو للسيراميك. سيارتك تخرج بمظهر مختلف تمامًا

source: Hesham Ismael
ar: هشام إسماعيل

source: You won’t find a better place to protect your car’s paint than Royal Nano Ceramic. Their service is top-notch and high-quality
ar: لن تجد مكانًا أفضل لحماية طلاء سيارتك من رويال نانو للسيراميك. خدماتهم عالية الجودة

source: Ghada Ibrahim
ar: غادة إبراهيم

source: If you want to keep your car shining all the time, Royal Nano Ceramic is the solution. I’m extremely satisfied with the results
ar: إذا كنت تريد الحفاظ على لمعان سيارتك دائمًا، رويال نانو للسيراميك هو الحل. أنا راضٍ تمامًا عن النتائج

source: Mahmoud hafez
ar: محمود حافظ

source: Honestly, excellent service and quality I haven’t seen anywhere else. My car is now protected and looks great
ar: بصراحة، خدمة وجودة ممتازة لم أراها في أي مكان آخر. سيارتي الآن محمية وتبدو رائعة

source: Enas elnagar
ar: إيناس النجار

source: Royal Nano Ceramic truly takes care of every detail of your car. I see a big difference in my car’s protection after using their services
ar: رويال نانو للسيراميك يعتني حقًا بكل تفاصيل سيارتك. لاحظت فرقًا كبيرًا في حماية سيارتي بعد استخدام خدماتهم

source: Emad Rashad
ar: عماد رشاد

source: The best protection and the most advanced technology for your car can be found at Royal Nano Ceramic. It was a wonderful experience
ar: أفضل حماية وأحدث تكنولوجيا لسيارتك تجدها في رويال نانو للسيراميك. كانت تجربة رائعة

source: Ahmad salama
ar: أحمد سلامة

source: Amazing service! My car is completely safe with Royal Nano Ceramic. Thanks to them for their professionalism
ar: خدمة رائعة! سيارتي آمنة تمامًا مع رويال نانو للسيراميك. شكرًا لهم على احترافيتهم

source: Our Storie
ar: قصتنا

source: 2015<small>05/10</small>
ar: ٢٠١٥<small>١٠/٠٥</small>

source: Company Launch
ar: إطلاق الشركة

source: Royal Nano Ceramic was established in 2015, offering top-quality ceramic coatings and car protection solutions for vehicles.
ar: تأسست رويال نانو للسيراميك في ٢٠١٥، لتقديم طلاءات سيراميك عالية الجودة وحلول حماية السيارات.

source: Company
ar: الشركة

source: Launch
ar: الإطلاق

source: 2017<small>15/03</small>
ar: ٢٠١٧<small>٠٣/١٥</small>

source: New Services Introduced
ar: إطلاق خدمات جديدة

source: Introduced a wide range of car detailing and paint protection services, including advanced nano-ceramic coatings.
ar: أطلقنا مجموعة واسعة من خدمات تنظيف السيارات وحماية الطلاء، بما في ذلك طلاءات النانو-سيراميك المتطورة.

source: Services
ar: الخدمات

source: Innovation
ar: الابتكار

source: 2018<small>27/07</small>
ar: ٢٠١٨<small>٠٧/٢٧</small>

source: Product Enhancement
ar: تحسين المنتج

source: Launched a new generation of high-performance ceramic coatings, improving durability, UV protection, and gloss finish.
ar: أطلقنا جيلًا جديدًا من طلاءات السيراميك عالية الأداء، مع تحسين المتانة وحماية من الأشعة فوق البنفسجية ولمعة نهائية.

source: Products
ar: المنتجات

source: Ceramic Coating
ar: الطلاء السيراميكي

source: 2020<small>12/01</small>
ar: ٢٠٢٠<small>٠١/١٢</small>

source: Expanding Market Presence
ar: التوسع في التواجد بالسوق

source: Opened new service centers across major cities in Egypt, enhancing accessibility for car owners seeking premium protection services.
ar: افتتحنا مراكز خدمة جديدة في المدن الكبرى بمصر، مما يعزز إمكانية الوصول لأصحاب السيارات الباحثين عن خدمات حماية فاخرة.

source: Expansion
ar: التوسع

source: Growth
ar: النمو

source: 2022<small>19/08</small>
ar: ٢٠٢٢<small>٠٨/١٩</small>

source: Customer Milestone
ar: معلم عملائي

source: Reached over 10,000 satisfied customers, solidifying our reputation as a trusted provider of car protection solutions.
ar: وصلنا إلى أكثر من ١٠٬٠٠٠ عميل راضٍ، مما عزز سمعة كموفر موثوق لحلول حماية السيارات.

source: Customers
ar: العملاء

source: Success
ar: النجاح

source: 2023<small>08/05</small>
ar: ٢٠٢٣<small>٠٥/٠٨</small>

source: Award Recognition
ar: تكريم وجوائز

source: Royal Nano Ceramic received the Best Car Protection Product Award for excellence in ceramic coating technology.
ar: حصلت Royal Nano Ceramic على جائزة أفضل منتج لحماية السيارات للتميز في تكنولوجيا طلاء السيراميك.

source: Awards
ar: الجوائز

source: Recognition
ar: تقدير

source: Future Vision
ar: رؤية مستقبلية

source: Announced plans for regional expansion and introduction of new eco-friendly car care products in 2024.
ar: أعلنت عن خطط للتوسع الإقليمي وإطلاق منتجات جديدة صديقة للبيئة للعناية بالسيارات في عام 2024.

source: Future
ar: مستقبل

source: Behind Royal Nano
ar: خلف رويال نانو

source: Lorem ipsum dolor sit amet consectetur adipisicing elit. Corrupti itaque vitae, optio veniam eum quasi! Ipsa voluptates eius aliquam inventore, nemo molestias accusantium dolore corrupti perspiciatis numquam omnis dolorum voluptate.
ar: لوريم إيبسوم دولور سيت أميت، كونسيكتيتور أدايبا إيليت. كورروبتي إيتاكي فيتاي، أوبتييو فينيام إيوم كوازاي! إيبسا فولوبتياس إيوس ألِكام إنفينتوري، نيمو مولِستيس أكيوسانتوم دولوري كورروبتي بيرسبيكاتيس نونكام أومنيس دولوروم فولوبتي.

source: heading
ar: عنوان

source: Lorem ipsum dolor sit amet consectetur adipisicing elit. Illo, ea.
ar: لوريم إيبسوم دولور سيت أميت، كونسيكتيتور أدايبا إيليت. إيلو، إيا.

source: Book Appointment
ar: حجز موعد

source: Join Royal Nano Ceramic Team
ar: انضم إلى فريق رويال نانو سيراميك

source: Royal Nano Ceramic always ready to work with all potential caders
ar: رويال نانو سيراميك مستعدة دائمًا للعمل مع جميع الكوادر المحتملة

source: Apply Now
ar: قدم الآن

source: Full Name
ar: الاسم الكامل

source: Enter your full name
ar: أدخل اسمك الكامل

source: Birthdate
ar: تاريخ الميلاد

source: Email
ar: البريد الإلكتروني

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Enter your phone number
ar: أدخل رقم هاتفك

source: Address
ar: العنوان

source: Enter your address
ar: أدخل عنوانك

source: Select a Role
ar: اختر وظيفة

source: -- Select Position --
ar: -- اختر المنصب --

source: Sales Manager
ar: مدير مبيعات

source: Tele Sales
ar: مبيعات هاتفية

source: Tele Sales Team Leader
ar: قائد فريق المبيعات الهاتفية

source: Indoor Sales "Special Conditions"
ar: مبيعات داخلية "شروط خاصة"

source: Outdoor Sales "Special Conditions"
ar: مبيعات خارجية "شروط خاصة"

source: Secretary
ar: سكرتير

source: Polish & Nano Technician
ar: فني تلميع وتقنية النانو

source: Protection Technician
ar: فني حماية

source: Assistant / Training
ar: مساعد / تدريب

source: Experienced Branch Manager
ar: مدير فرع ذو خبرة

source: Upload CV
ar: تحميل السيرة الذاتية

source: Cover Letter
ar: رسالة تعريفية

source: Write a short cover letter
ar: اكتب رسالة تعريفية قصيرة

source: Submit Application
ar: إرسال الطلب

source: Service Confirmation
ar: تأكيد الخدمة

source: Your name
ar: اسمك

source: Name Should be at least 3 characters
ar: يجب أن يكون الاسم 3 أحرف على الأقل

source: Phone number
ar: رقم الهاتف

source: Required
ar: مطلوب

source: Your Address
ar: عنوانك

source: Address should be valid
ar: يجب أن يكون العنوان صالحًا

source: Car brand
ar: ماركة السيارة

source: Car model Ex: 2024
ar: موديل السيارة مثال: 2024

source: Required and should be valid
ar: مطلوب ويجب أن يكون صالحًا

source: Car color
ar: لون السيارة

source: Your Email
ar: بريدك الإلكتروني

source: Please enter a valid Email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

source: Submit @if (loading) {<i class="fa-solid fa-spinner fa-spin ms-2"></i>}
ar: إرسال @if (loading) {<i class="fa-solid fa-spinner fa-spin ms-2"></i>}

source: Sorry this serial number owned by mr: {{ ownedBy.name }}
ar: عذرًا، رقم السيريال هذا مملوك للسيد: {{ ownedBy.name }}

source: His phone number is ( ******** {{ ownedBy.phoneNumber }} )
ar: رقم هاتفه هو ( ******** {{ ownedBy.phoneNumber }} )

source: How can we help you?
ar: كيف يمكننا مساعدتك؟

source: Contact us
ar: اتصل بنا

source: We’re here to help and answer any questions you might have. We look forward to hearing from you!
ar: نحن هنا لمساعدتك والإجابة على أي أسئلة قد تكون لديك. نتطلع إلى الاستماع منك!

source: tanta
ar: طنطا

source: october
ar: أكتوبر

source: madenetNasr
ar: مدينة نصر

source: zayed
ar: زايد

source: madenetNasr2
ar: مدينة نصر 2

source: Mohandessin
ar: المهندسين

source: Alexandria
ar: الإسكندرية

source: Sohag
ar: سوهاج

source: Hurghada
ar: الغردقة

source: Mansoura
ar: المنصورة

source: Zagazig
ar: الزقازيق

source: Ismailia
ar: الإسماعيلية

source: Port Said
ar: بورسعيد

source: Suez
ar: السويس

source: Minya
ar: المنيا

source: Assiut
ar: أسيوط

source: Follow Us
ar: تابعنا

source: About Us
ar: من نحن

source: Contact
ar: اتصال

source: Careers
ar: وظائف

source: Privacy Policy
ar: سياسة الخصوصية

source: October
ar: أكتوبر

source: Nasr City
ar: مدينة نصر

source: Sheikh Zayed
ar: الشيخ زايد

source: Tanta
ar: طنطا

source: See All
ar: رؤية الكل

source: Reach out!
ar: تواصل معنا!

source: Royal Nano Ceramic is a leading car protection company in Egypt, offering advanced nano ceramic coatings to protect and enhance vehicle exteriors. They specialize in paint protection, scratch resistance, and hydrophobic coatings, ensuring cars remain in top condition.
ar: شركة رويال نانو سيراميك هي شركة رائدة في مجال حماية السيارات في مصر، تقدم طبقات طلاء نانو سيراميك متطورة لحماية وتعزيز المظهر الخارجي للسيارات. وهي متخصصة في حماية الطلاء، ومقاومة الخدوش، والطلاءات الطاردة للماء، مما يضمن بقاء السيارات في أفضل حالة.

source: Flexible Services
ar: خدمات مرنة

source: Smart solutions for all your charter requirements
ar: حلول ذكية لجميع متطلباتك

source: All Solutions
ar: جميع الحلول

source: Your reliable Partners
ar: شركاؤك الموثوق بهم

source: About us
ar: من نحن

source: Always There to help you
ar: موجودون دائمًا لمساعدتك

source: Contact Us
ar: اتصل بنا

source: Premium Ceramic Coating
ar: طلاء سيراميك فاخر

source: Royal Nano provides top-quality ceramic coating for ultimate car protection and longevity.
ar: توفر Royal Nano طلاء سيراميك عالي الجودة لحماية السيارة وطول عمرها.

source: Advanced Car Protection
ar: حماية متطورة للسيارات

source: At Royal Nano, we specialize in innovative solutions to keep your vehicle looking new for years.
ar: في Royal Nano، نحن متخصصون في الحلول المبتكرة للحفاظ على مظهر سيارتك جديدًا لسنوات.

source: Graphene Hybrid Plus
ar: جرافين هايبرد بلس

source: Nano Graphene
ar: نانو جرافين

source: Max Pro
ar: ماكس برو

source: Paint Protection
ar: حماية الطلاء

source: Shield UltraCool
ar: شيلد ألترا كول

source: Thermal Insulation
ar: عزل حراري

source: OUR SOLUTIONS
ar: حلولنا

source: Royal Nano Ceramic offers advanced protection services for vehicles, aircraft, boats, and motorcycles in Egypt. Using the best international materials and modern nano-ceramic technologies, the company ensures top-level protection and quality, delivering a unique experience that makes them the leading choice in the market.
ar: تقدم شركة رويال نانو سيراميك خدمات حماية متطورة للسيارات والطائرات والقوارب والدراجات النارية في مصر. باستخدام أفضل المواد العالمية وأحدث تقنيات النانو-سيراميك، تضمن الشركة أعلى مستوى من الحماية والجودة، وتقدم تجربة فريدة تجعلها الخيار الرائد في السوق.

source: Luxury Car Protection
ar: حماية السيارات الفاخرة

source: Our ceramic coating ensures long-lasting protection for luxury vehicles, preserving their shine and guarding against scratches and environmental damage.
ar: يضمن طلاء السيراميك الخاص بنا حماية طويلة الأمد للسيارات الفاخرة، مما يحافظ على لمعانها ويحميها من الخدوش والأضرار البيئية.

source: Aircraft Protection
ar: حماية الطائرات

source: We provide nano technology coatings that protect aircraft from UV damage and corrosion, keeping them in excellent condition over time.
ar: نحن نقدم طلاءات بتقنية النانو تحمي الطائرات من أضرار الأشعة فوق البنفسجية والتآكل، مما يحافظ عليها في حالة ممتازة بمرور الوقت.

source: Yacht Protection
ar: حماية اليخوت

source: Our nano coatings offer protection against saltwater and UV rays, helping to maintain the yacht's appearance and durability.
ar: توفر طلاءات النانو الخاصة بنا حماية ضد المياه المالحة والأشعة فوق البنفسجية، مما يساعد في الحفاظ على مظهر ومتانة اليخت.

source: Motorcycle Protection
ar: حماية الدراجات النارية

source: Specialized nano coatings protect motorcycles from scratches and wear, ensuring they remain in great condition across various environments.
ar: تحمي طلاءات النانو المتخصصة الدراجات النارية من الخدوش والتآكل، مما يضمن بقائها في حالة ممتازة في مختلف البيئات.

source: Home
ar: الصفحة الرئيسية

source: About
ar: عنا

source: Services
ar: الخدمات

source: Blog
ar: المدونة

source: Gallery
ar: معرض الصور

source: Contact
ar: اتصل

source: Privacy and Usage Policy
ar: سياسة الخصوصية والاستخدام

source: <i class="fas fa-info-circle"></i> Introduction
ar: <i class="fas fa-info-circle"></i> مقدمة

source: Welcome to the Royal Nano Ceramic website. We are committed to protecting your privacy and ensuring the best possible experience with our services. This policy explains how we collect, use, and protect your personal information, along with the terms of use for our services.
ar: مرحبًا بكم في موقع رويال نانو سيراميك. نحن ملتزمون بحماية خصوصيتك وضمان أفضل تجربة ممكنة مع خدماتنا. توضح هذه السياسة كيفية جمعنا لمعلوماتك الشخصية واستخدامها وحمايتها، إلى جانب شروط استخدام خدماتنا.

source: <i class="fas fa-user-shield"></i> Collection and Use of Information
ar: <i class="fas fa-user-shield"></i> جمع واستخدام المعلومات

source: We may collect the following information:
ar: قد نقوم بجمع المعلومات التالية:

source: <strong>Personal Information:</strong> Your name, email, phone number, and billing address.
ar: <strong>المعلومات الشخصية:</strong> اسمك، بريدك الإلكتروني، رقم هاتفك، وعنوان إرسال الفواتير.

source: <strong>Vehicle Information:</strong> Make, model, and year, to customize our services.
ar: <strong>معلومات السيارة:</strong> الصنع، الموديل، والسنة، لتخصيص خدماتنا.

source: <strong>Usage Data:</strong> IP addresses and browsing behavior.
ar: <strong>بيانات الاستخدام:</strong> عناوين IP وسلوك التصفح.

source: <i class="fas fa-cogs"></i> Use of Information
ar: <i class="fas fa-cogs"></i> استخدام المعلومات

source: We use the information for the following purposes:
ar: نستخدم المعلومات للأغراض التالية:

source: <strong>Service Delivery:</strong> To process orders and perform car protection services.
ar: <strong>تقديم الخدمة:</strong> لمعالجة الطلبات وتقديم خدمات حماية السيارات.

source: <strong>Customer Support:</strong> To respond to inquiries and improve services.
ar: <strong>دعم العملاء:</strong> للرد على الاستفسارات وتحسين الخدمات.

source: <strong>Communication:</strong> To send updates on services or offers.
ar: <strong>التواصل:</strong> لإرسال التحديثات حول الخدمات أو العروض.

source: <i class="fas fa-lock"></i> Protection of Information
ar: <i class="fas fa-lock"></i> حماية المعلومات

source: We take necessary steps to protect your personal information. However, please note that no method of transmission over the internet is completely secure.
ar: نتخذ الخطوات اللازمة لحماية معلوماتك الشخصية. ومع ذلك، يرجى ملاحظة أنه لا توجد طريقة نقل عبر الإنترنت آمنة تمامًا.

source: <i class="fas fa-check-circle"></i> Service Warranty
ar: <i class="fas fa-check-circle"></i> ضمان الخدمة

source: Royal Nano Ceramic offers a certified warranty on all car paint protection services, covering issues related to quality or application.
ar: تقدم شركة رويال نانو سيراميك ضمانًا معتمدًا على جميع خدمات حماية طلاء السيارات، ويغطي المشكلات المتعلقة بالجودة أو التطبيق.

source: <i class="fas fa-dollar-sign"></i> Refund Policy
ar: <i class="fas fa-dollar-sign"></i> سياسة الاسترداد

source: Once the protective coating application is completed, the agreement is final. No refunds are offered post-service, as we ensure the highest quality protection for your vehicle.
ar: بمجرد الانتهاء من تطبيق الطلاء الواقي، يكون الاتفاق نهائيًا. لا يتم تقديم أي مبالغ مستردة بعد الخدمة، حيث نضمن أعلى جودة للحماية لمركبتك.

source: <i class="fas fa-globe"></i> Website Usage
ar: <i class="fas fa-globe"></i> استخدام الموقع

source: By using our website, you agree to our terms. Violations may lead to suspension of access.
ar: باستخدامك لموقعنا، فإنك توافق على شروطنا. قد تؤدي الانتهاكات إلى تعليق الوصول.

source: <i class="fas fa-cookie-bite"></i> Cookies
ar: <i class="fas fa-cookie-bite"></i> ملفات تعريف الارتباط (الكوكيز)

source: We use cookies to enhance your experience on our website. You can manage cookie settings through your browser.
ar: نستخدم ملفات تعريف الارتباط لتحسين تجربتك على موقعنا. يمكنك إدارة إعدادات ملفات تعريف الارتباط من خلال متصفحك.

source: <i class="fas fa-share-alt"></i> Sharing Information with Third Parties
ar: <i class="fas fa-share-alt"></i> مشاركة المعلومات مع أطراف ثالثة

source: Your personal information is not shared with third parties, except as required for service delivery or by law.
ar: لا تتم مشاركة معلوماتك الشخصية مع أطراف ثالثة، إلا إذا كان ذلك مطلوبًا لتقديم الخدمة أو بموجب القانون.

source: <i class="fas fa-user-tag"></i> Your Rights
ar: <i class="fas fa-user-tag"></i> حقوقك

source: You can access, modify, or request deletion of your personal information at any time.
ar: يمكنك الوصول إلى معلوماتك الشخصية أو تعديلها أو طلب حذفها في أي وقت.

source: <i class="fas fa-sync-alt"></i> Changes to the Policy
ar: <i class="fas fa-sync-alt"></i> التغييرات في السياسة

source: We may update this policy occasionally. Any changes will be posted here.
ar: قد نقوم بتحديث هذه السياسة من حين لآخر. سيتم نشر أي تغييرات هنا.

source: <i class="fas fa-envelope"></i> Contact Us
ar: <i class="fas fa-envelope"></i> اتصل بنا

source: For inquiries, please contact us:
ar: للاستفسارات، يرجى الاتصال بنا:

source: <strong>Email:</strong> contact@royalnanoceramic.com
ar: <strong>البريد الإلكتروني:</strong> contact@royalnanoceramic.com

source: <strong>Phone:</strong> +20 103 2222 542
ar: <strong>الهاتف:</strong> +20 103 2222 542

source: Nano ceramic products
ar: منتجات النانو سيراميك

source: Book Now
ar: احجز الآن

source: Daimond Hypred+
ar: دايموند هايبرد+

source: <span class="fw-medium">Warranty:</span> 7 years
ar: <span class="fw-medium">الضمان:</span> 7 سنوات

source: <span class="fw-medium">Hardness:</span> 9H+
ar: <span class="fw-medium">الصلابة:</span> 9H+

source: <span class="fw-medium">Elements:</span> Daimond
ar: <span class="fw-medium">العناصر:</span> دايموند

source: <span class="fw-medium">Country of manufacture:</span> USA
ar: <span class="fw-medium">بلد المنشأ:</span> الولايات المتحدة الأمريكية

source: Daimond Hypred
ar: دايموند هايبرد

source: <span class="fw-medium">Warranty:</span> 5 years
ar: <span class="fw-medium">الضمان:</span> 5 سنوات

source: <span class="fw-medium">Hardness:</span> 9H
ar: <span class="fw-medium">الصلابة:</span> 9H

source: Ultra Nano Ceramic
ar: الترا نانو سيراميك

source: <span class="fw-medium">Elements:</span> Silicone/Polysilazine
ar: <span class="fw-medium">العناصر:</span> سيليكون/بوليسيلزين

source: <span class="fw-medium">Country of manufacture:</span> Germany
ar: <span class="fw-medium">بلد المنشأ:</span> ألمانيا

source: Daimond N1
ar: دايموند N1

source: <span class="fw-medium">Hardness:</span> 8H
ar: <span class="fw-medium">الصلابة:</span> 8H

source: <span class="fw-medium">Elements:</span> diamond
ar: <span class="fw-medium">العناصر:</span> الماس

source: Nanolex
ar: نانولكس

source: Nano system x
ar: نانو سيستم اكس

source: <span class="fw-medium">Elements:</span> Diamond
ar: <span class="fw-medium">العناصر:</span> الماس

source: See the Difference
ar: شاهد الفرق

source: Nano graphene products
ar: منتجات نانو جرافين

source: <span class="fw-medium">Warranty:</span> 12 years
ar: <span class="fw-medium">الضمان:</span> 12 سنة

source: <span class="fw-medium">Hardness:</span> 10h+
ar: <span class="fw-medium">الصلابة:</span> 10h+

source: <span class="fw-medium">Elements:</span> 98% carbon fiber
ar: <span class="fw-medium">العناصر:</span> 98% ألياف كربون

source: Graphene Hybrid
ar: جرافين هايبرد

source: <span class="fw-medium">Warranty:</span> 10 years
ar: <span class="fw-medium">الضمان:</span> 10 سنوات

source: <span class="fw-medium">Elements:</span> 85% carbon fiber
ar: <span class="fw-medium">العناصر:</span> 85% ألياف كربون

source: Graphene Pro
ar: جرافين برو

source: <span class="fw-medium">Elements:</span> 70% carbon fiber
ar: <span class="fw-medium">العناصر:</span> 70% ألياف كربون

source: Graphene pro
ar: جرافين برو

source: <span class="fw-medium">Hardness:</span> 8H+
ar: <span class="fw-medium">الصلابة:</span> 8H+

source: <span class="fw-medium">Elements:</span> 65% carbon fiber
ar: <span class="fw-medium">العناصر:</span> 65% ألياف كربون

source: Adms graphene
ar: أدمنس جرافين

source: Graphene nanolex
ar: جرافين نانولكس

source: Paint Protection Film Products
ar: منتجات فيلم حماية الطلاء

source: Dyno Stick
ar: دينو ستيك

source: Expel Ultimate
ar: اكسبيل التيميت

source: 3m Scotchgard
ar: 3m سكوتش جارد

source: Elegance Guard
ar: إليجانس جارد

source: Number <span class="light-blue">#1</span> car protection service in egypt
ar: الخدمة رقم <span class="light-blue">#1</span> لحماية السيارات في مصر

source: Protect your vehicle with Royal Nano's #1 nano-ceramic coatings, hybrid technologies, and premium paint films.
ar: احمِ سيارتك مع طبقات النانو سيراميك رقم 1 من رويال نانو، والتقنيات الهجينة، وأفلام الطلاء المميزة.

source: Our Services
ar: خدماتنا

source: Diamond Hybrid Plus
ar: دايموند هايبرد بلس

source: Nano ceramic
ar: نانو سيراميك

source: Available Everywhere
ar: متوفر في كل مكان

source: Damietta, Damietta Governorate, Egypt
ar: دمياط، محافظة دمياط، مصر

source: Asyut, Asyut Governorate, Egypt
ar: أسيوط، محافظة أسيوط، مصر
