Repository: yehiaAboulela/roya-nano-app
Catalog: src/locale/messages.*.xlf
Languages: ar

source: Alexandria, Alexandria Governorate, Egypt
ar: الإسكندرية، محافظة الإسكندرية، مصر

source: 6 October City, Giza Governorate, Egypt
ar: مدينة 6 أكتوبر، محافظة الجيزة، مصر

source: Tanta, Gharbia Governorate, Egypt
ar: طنطا، محافظة الغربية، مصر

source: Nasr City, Cairo Governorate, Egypt
ar: مدينة نصر، محافظة القاهرة، مصر

source: El Haram, Beni Suef Governorate, Egypt
ar: الهرم، محافظة بني سويف، مصر

source: Royal Nano is available everywhere across Egypt with a wide network of branches. Our strategically located branches ensure that no matter where you are, you have access to our premium car protection services. Each branch is staffed with highly trained professionals ready to deliver the best in nano-ceramic coatings, paint protection films, and more. We’re committed to making it convenient for you to keep your car looking its best, no matter your location
ar: رويال نانو متوفرة في كل مكان في جميع أنحاء مصر بشبكة واسعة من الفروع. تضمن فروعنا ذات المواقع الإستراتيجية أنه بغض النظر عن مكان تواجدك، يمكنك الوصول إلى خدماتنا المتميزة لحماية السيارات. كل فرع يعمل به محترفون مدربون تدريباً عالياً على استعداد لتقديم الأفضل في طلاءات النانو سيراميك، وأفلام حماية الطلاء، والمزيد. نحن ملتزمون بتسهيل الأمر عليك للحفاظ على مظهر سيارتك في أفضل حالاتها، بغض النظر عن موقعك

source: Professional Ceramic Services
ar: خدمات السيراميك الاحترافية

source: Enhance your vehicle's durability and shine with Royal Nano’s expert ceramic coating services.
ar: عزز متانة ولمعان سيارتك مع خدمات طلاء السيراميك الخبيرة من رويال نانو.

source: Previous
ar: السابق

source: Next
ar: التالي

source: What Are Waiting for?
ar: ماذا تنتظر؟

source: Protect Your Car Now
ar: احمِ سيارتك الآن

source: Royal
ar: رويال

source: Nano Ceramic
ar: نانو سيراميك

source: <span class="text-gold">Royal</span> Nano Ceramic
ar: <span class="text-gold">رويال</span> نانو سيراميك

source: Protect your car
ar: احمِ سيارتك

source: Royal Nano
ar: رويال نانو

source: Hexes
ar: هيكسس

source: <span class="fw-medium">Country of manufacture:</span> France
ar: <span class="fw-medium">بلد المنشأ:</span> فرنسا

source: Premium 8
ar: بريميوم 8

source: PRO VISION
ar: برو فيجن

source: Professional Shield
ar: بروفيشنال شيلد

source: Thermal isulation Products
ar: منتجات العزل الحراري

source: Shield Solar Guard
ar: شيلد سولار جارد

source: Shield Ultra Cool
ar: شيلد ألترا كول

source: 3m crystalline
ar: 3m كريستالاين

source: <span class="fw-medium">Life expectancy:</span> 3 years
ar: <span class="fw-medium">العمر الافتراضي:</span> 3 سنوات

source: uv400 films
ar: أفلام uv400

source: <span class="fw-medium">Life expectancy:</span> 1 year
ar: <span class="fw-medium">العمر الافتراضي:</span> سنة واحدة

source: Thank You!
ar: شكراً لك!

source: please go to nearest branch to receive your gift
ar: يرجى الذهاب إلى أقرب فرع لاستلام هديتك

source: Return Home
ar: العودة للصفحة الرئيسية

source: Your submission has been received. We will get back to you soon.
ar: تم استلام طلبك. سنعاود التواصل معك قريباً.
